@extends('layouts.home')

@section('content')

    <!-- Main Content -->
    <main class="flex-1 p-6">

        <div class="bg-white shadow-sm rounded-lg p-4">
            <h1 class="mb-5 text-xl font-semibold">Новые слова ({{ $newWords }})</h1>

        <div class="grid grid-cols-3 gap-5">
            <div onclick="window.location.href = '{{ route('training-start') }}'" class="@if ($newWords == 0) non-clickable @endif  bg-sky-700 text-white shadow-md rounded-lg p-4 col-span-2 hover:bg-sky-600 cursor-pointer flex items-center">
                    <div>
                        <svg xmlns="http://www.w3.org/2000/svg" width="70" height="70" viewBox="0 0 512 512"><path fill="#132028" d="M414.531 341.538v.003c0 50.556-68.509 91.541-153.02 91.541c-73.06 0-134.142-30.634-149.357-71.599l-6.635-1.594v-11.492l-2.972-1.334c-6.771-3.038-6.771-8.01 0-11.048l2.972-1.334V232.763l92.177 25.56c19.424-5.34 41.036-8.322 63.815-8.322c24.188 0 47.059 3.362 67.395 9.34l85.625-20.578v102.775z"/><path fill="#FFB636" d="m122.592 389.093l5.153 56.089c.977 10.633-6.851 20.045-17.485 21.022s-20.045-6.851-21.022-17.485a20.59 20.59 0 0 1 0-3.538l5.153-56.089c.715-7.788 7.608-13.521 15.396-12.805c6.908.635 12.198 6.137 12.805 12.806z"/><path fill="#464A4C" d="M236.306 345.585L10.521 220.269c-10.831-6.012-10.831-15.849 0-21.861L236.306 73.093c10.831-6.012 28.556-6.012 39.387 0l225.785 125.316c10.831 6.012 10.831 15.849 0 21.861L275.694 345.585c-10.832 6.012-28.556 6.012-39.388 0z"/><path fill="#FFD592" d="M108.492 395.822c-16.022 0-29.011-12.989-29.011-29.012v-7.503c0-16.022 12.989-29.012 29.011-29.012s29.011 12.989 29.011 29.012v7.503c0 16.023-12.989 29.012-29.011 29.012z"/><path fill="#FFB636" d="M108.492 368.861c-8.332 0-15.086-6.754-15.086-15.086v-68.631c0-5.361 2.846-10.32 7.475-13.025l147.508-86.194c7.194-4.203 16.433-1.779 20.637 5.415c4.203 7.193 1.779 16.433-5.414 20.636l-140.034 81.826v59.974c0 8.331-6.755 15.085-15.086 15.085z"/><path fill="#132028" d="M290.332 198.95c0 13.307-15.371 24.094-34.332 24.094s-34.332-10.787-34.332-24.094s15.371-24.094 34.332-24.094s34.332 10.787 34.332 24.094z"/></svg>
                    </div>
                    <div class="ml-5">
                    <h2 class="text-lg mb-3 font-semibold">Слово — описание</h2>
                    <p>Начните изучение новых слов с этой тренировки</p>
                    </div>
            </div>
        </div>
        </div>

        <div class="bg-white shadow-sm rounded-lg p-4 mt-5">
            <h1 class="mb-5 text-xl font-semibold">Слова для повторения ({{ $repeatWords }})</h1>

        <div class="grid grid-cols-3 gap-5 mt-10">

            <div onclick="window.location.href = '{{ route('training-repeat') }}'" class="@if ($repeatWords == 0) non-clickable @endif bg-emerald-200 flex items-center  shadow-md rounded-lg p-4 col-span-1 hover:bg-emerald-300 cursor-pointer">
                <div>
                    <svg xmlns="http://www.w3.org/2000/svg" width="45" height="45" viewBox="0 0 100 100"><circle cx="50" cy="50" r="50" fill="#E74C3C"/><path fill="none" stroke="#F0C419" stroke-dasharray="216 0" stroke-dashoffset="43" stroke-linecap="square" stroke-miterlimit="10" stroke-width="8" d="M12.5 50.5c0 10 7 17 17 17c17 0 26-34 43-34c10 0 18 7 18 17s-8 17-18 17c-17 0-26-34-43-34c-10 0-17 7-17 17z"/><path d="m45.938 50.5l5.047 6.516s-2.141 2.797-3.5 4.25c0 0-3.621-3.552-5.746-5.583c1.308-1.402 4.199-5.183 4.199-5.183z" opacity=".15"/></svg>
                </div>
                <div class="ml-5">
                    <h2 class="mb-3 font-semibold">Повторение</h2>
                    <div class="mb-1 text-sm">Выберите правильное слово среди предложенных</div>
                </div>
            </div>

            <div onclick="window.location.href = '{{ route('training-description-word') }}'" class="@if ($repeatWords == 0) non-clickable @endif bg-indigo-200 shadow-md rounded-lg p-4 col-span-1 hover:bg-indigo-300 cursor-pointer flex items-center">
                <div>
                        <svg xmlns="http://www.w3.org/2000/svg" width="45" height="45" viewBox="0 0 512 512"><path fill="#EAC083" d="M446.067 512h-217.97c-2.818 0-5.102-3.663-5.102-8.182V8.182c0-4.519 2.284-8.182 5.102-8.182H446.23c2.727 0 4.938 3.546 4.938 7.92v495.898c.001 4.519-2.283 8.182-5.101 8.182z"/><path fill="#F9E7C0" d="M392.753 512H191.967L35.007 355.04V8.182A8.182 8.182 0 0 1 43.189 0h349.826a7.92 7.92 0 0 1 7.92 7.92v495.898a8.182 8.182 0 0 1-8.182 8.182z"/><path fill="#597B91" d="M303.694 456.668h-60.108c-6.147 0-11.13-4.983-11.13-11.13s4.983-11.13 11.13-11.13h60.108c6.146 0 11.13 4.983 11.13 11.13s-4.983 11.13-11.13 11.13zm59.646-83.983c0-6.146-4.983-11.13-11.13-11.13H243.586c-6.147 0-11.13 4.983-11.13 11.13s4.983 11.13 11.13 11.13H352.21c6.146-.001 11.13-4.984 11.13-11.13zm-23.867-72.854c0-6.146-4.983-11.13-11.13-11.13h-84.757c-6.147 0-11.13 4.983-11.13 11.13s4.983 11.13 11.13 11.13h84.757c6.146 0 11.13-4.983 11.13-11.13zm-49.297-72.853c0-6.147-4.983-11.13-11.13-11.13H102.809c-6.147 0-11.13 4.983-11.13 11.13s4.983 11.13 11.13 11.13h176.237c6.146-.001 11.13-4.983 11.13-11.13zm-92.007 72.853c0-6.146-4.983-11.13-11.13-11.13h-84.231c-6.147 0-11.13 4.983-11.13 11.13s4.983 11.13 11.13 11.13h84.231c6.148 0 11.13-4.983 11.13-11.13zm110.859-145.707c0-6.147-4.983-11.13-11.13-11.13h-195.09c-6.147 0-11.13 4.983-11.13 11.13s4.983 11.13 11.13 11.13h195.09c6.147 0 11.13-4.983 11.13-11.13zm54.312-72.853c0-6.147-4.983-11.13-11.13-11.13H102.809c-6.147 0-11.13 4.983-11.13 11.13s4.983 11.13 11.13 11.13H352.21c6.146 0 11.13-4.983 11.13-11.13z"/><path fill="#EAC083" d="M191.967 512L35.007 355.04h123.597c18.426 0 33.363 14.937 33.363 33.363V512z"/></svg>
                </div>
                <div class="ml-5">
                    <h2 class="mb-3 font-semibold">Слова по описанию</h2>
                    <div class="mb-1 text-sm">Вспомните слово по описанию</div>
                </div>
            </div>


            <div onclick="window.location.href = '{{ route('training-sentence') }}'" class="non-clickable bg-green-700 text-white shadow-md rounded-lg p-4 col-span-1 hover:bg-blue-100 cursor-pointer flex items-center">
                <div>
                    <svg xmlns="http://www.w3.org/2000/svg" width="45" height="45" viewBox="0 0 100 100"><circle cx="50" cy="50" r="50" fill="#2C3E50"/><path fill="none" d="M16.488 73.027L70.906 18.61c1.172-1.172 4.021-.222 6.364 2.121s3.293 5.193 2.121 6.364L24.973 81.513l-8.485-8.486z" clip-rule="evenodd"/><path fill="#ECF0F1" fill-rule="evenodd" d="M64.906 29.609L12.018 82.497a50.269 50.269 0 0 0 8.847 8.124l52.527-52.527c1.172-1.171.222-4.021-2.121-6.364c-2.344-2.342-5.194-3.292-6.365-2.121z" clip-rule="evenodd"/><path fill="#F0C419" d="M88.5 23.002c.767-6.901 4.6-10.735 11.5-11.501c-6.9-.767-10.734-4.6-11.5-11.5c-.767 6.9-4.6 10.734-11.5 11.5c6.899.766 10.733 4.6 11.5 11.501zM31.5 0c-.5 4.5-3 7-7.501 7.501c4.5.5 7.001 3 7.501 7.5c.5-4.5 3-7 7.501-7.5C34.5 7 32 4.5 31.5 0zm60 46.001c-.5 4.5-3 7-7.501 7.501c4.5.5 7.001 3 7.501 7.5c.5-4.5 3-7 7.501-7.5C94.5 53.001 92 50.5 91.5 46.001z"/><path fill="#fff" d="M71.5 53c-.367 3.299-2.2 5.133-5.5 5.5c3.3.366 5.134 2.2 5.5 5.499c.367-3.299 2.2-5.133 5.5-5.499c-3.3-.367-5.134-2.202-5.5-5.5zm-25-31.001c-.367 3.3-2.2 5.134-5.5 5.501c3.3.367 5.134 2.199 5.5 5.5c.367-3.301 2.2-5.133 5.5-5.5c-3.3-.367-5.134-2.201-5.5-5.501zM58.5 3c-.367 3.298-2.2 5.133-5.5 5.5c3.3.366 5.134 2.2 5.5 5.499c.366-3.299 2.2-5.133 5.5-5.499c-3.3-.367-5.134-2.202-5.5-5.5z"/></svg>
                </div>
                <div class="ml-5">
                    <h2 class="mb-3 font-semibold">Слова в предложении</h2>
                    <div class="mb-1 text-sm">В разработке</div>
                </div>
            </div>
        </div>
    </main>

@endsection

